isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
//#############################################################################
//
// FILE:   ethercat_slave_c28x_hal.c
//
// TITLE:  C28x HAL level functions for EtherCAT slave controller (ESC)
//
//! \addtogroup C2k_EtherCAT_adapater_examples_list
//! <h1> PDI Interface test Example </h1>
//!
//! The functions in this file provide a HAL layer interface for EtherCAT slave
//! applications that can be built on C2k EtherCAT adapter board
//!
//! The HAL could be EMIF or SPI based depending on the PDI interface chosen
//! or configured for the C2k ET1100 EtherCAT adapater board
//!
//!-----------------------------------------------------------------------------
//! C28x Addressing vs. TwinCat3 software addresses for EMIF PDI
//!   The C28x address used below is a WORD (16b) address for the ET1100 PDI
//!   interface, while Beckhoff EtherCAT documentation and TwinCat3 software use
//!   BYTE addresses. The USER RAM on the ET1100 starts at 0x1000 offset BYTE
//!   address. Divide this by 2 to get the correct 16b word offset from EMIF2
//!   start address
//!
//!  EMIF PDI reads two bytes at a time from ET1100 address space, that is the
//!  minimum data size thats readable by C28x CPU
//!------------------------------------------------------------------------------
//!------------------------------------------------------------------------------
//! C28x Addressing vs. TwinCat3 software addresses for SPI PDI
//!   For the SPI PDI the addressing of ET1100 memory space is straight forward
//!   The SPI PDI uses 8 bit character length for SPI reads/writes but the HAL API
//!   is adjusted to read 16bits at a time to be consistent with the EMIF PDI.
//!   Users can modify the SPI PDI to read/write one byte at a time from ET1100
//!   address space. But since C28x data bus is 16 bit wide this example shows
//!   16bit SPI PDI reads/writes as well.
//!
//!   SPI MISO pin read for error status on the last transaction is not supported
//!      in this HAL
//!   SPI MODE 3 is supported by this HAL
//!   I0 and I1 byte reads on the MISO pin are ignored in this HAL
//!------------------------------------------------------------------------------
//! \b External \b Connections \n
//!  Users can connect a PC running TWINCAT3 to the Ethercat Slave and view the
//!  memory window of ET1100 for both registers and ET1100 RAM
//!
//! \b Watch \b Variables \n
//!  - escRegs data structure is filled in with some ET1100 registers which can be
//!    viewed in memory window if HAL Test is enabled.
//!
//!
////###########################################################################
// $TI Release: C2000 EtherCAT solutions support v1.00 $
// $Release Date: 07/2017 $
// $Copyright:
// Copyright (C) 2017 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions
// are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################

//
// Included Files
//
#include "F28x_Project.h"     // Device Headerfile and Examples Include File
#include "F2837xD_spi.h"
#include "ethercat_slave_c28x_hal.h"

//
// Defines
//
//#define ETHERCAT_STACK  1   //only use if EtherCAT slave stack is used

//
//globals
//

//Pointer to the ESC memory, initialized in the ESC_initHW()
//used only for the ASYNC16 (EMIF1 or EMIF2) PDI
uint16_t *pEsc;

#ifdef PDI_HAL_TEST
//Debug array to log esc registers, used only for PDI HAL TEST
esc_et1100_regs_t escRegs[ESC_DEBUG_REGS_LENGTH];
#endif

#ifdef INTERFACE_SPI
// SPI Variables
volatile uint16_t   SPI_RxData[16];     // Receive data buffer
volatile uint16_t   SPI_XmitInProgress;
#endif


//
//HAL level functions
//
#ifndef __cplusplus

#ifdef INTERFACE_SPI
#pragma CODE_SECTION(ESC_readSPI, ".TI.ramfunc");
#pragma CODE_SECTION(ESC_writeSPI, ".TI.ramfunc");
#endif
#pragma CODE_SECTION(ESC_timerIncPerMilliSec, ".TI.ramfunc");
#pragma CODE_SECTION(ESC_getTimer, ".TI.ramfunc");
#endif

/***********************************************************************************/

uint32_t ESC_getTimer(void)
{
    //C28x timer is decrements from 0xFFFFFFFF while the stack understands it as of 
    //increment type. 
    return ~ ((uint32_t)(CpuTimer0Regs.TIM.all));
}
/***********************************************************************************/
void ESC_clearTimer(void)
{
    CpuTimer0Regs.TIM.all = 0;
}
/***********************************************************************************/
uint32_t ESC_timerIncPerMilliSec(void)
{
    return (uint32_t) 200000UL; //at 200MHz
}
/***********************************************************************************/
#ifdef INTERFACE_SPI
//
// SPI HAL functions for EtherCAT slave stack
//

//SPI peripehral register pointer, will be initialized depending on the SPI chosen as per
// build configurations
volatile struct SPI_REGS *SpixRegs;

/*****************************************************************************************
 * @fn          ESC_readSPI
 * @brief       读取寄存器数据，三字节地址模式，最大一次读取12字节数据
 *
 * @param
 *     offset_addr  - ESC address from which data has to be read
 *     numbytes     - number of bytes to be read, limited to 12 at a time by the caller
 *     buffer       - pointer to the buffer where read data has to be copied to
 *                  - if a NULL is passed then data is copied to SPI_RxData global array
 *
 * @return          - None
 ****************************************************************************************/
void ESC_readSPI(uint16_t offset_addr,uint16_t numbytes, uint16_t* buffer)
{
    uint16_t i,readval;
    uint16_t readphase[16];
    uint16_t *buf = (uint16_t *)0;

