isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
  if(((void *)buffer) == NULL)
   {
      buf = (uint16_t *)&SPI_RxData[0];
   }
   else
   {
    buf = buffer;
   }
        //三字节地址帧格式
        // SPI模式为高位在前，低字节在前
        // 读数据帧格式:
        // Byte 0: A[12:5]    //地址的5-12位
        // Byte 1: A[4:0], 110b             (110b为三字节地址命令)
        // Byte 2: A[15:13], CMD[2:0], 00b  (010b为读数据命令)
    //计算第一个字节(全部高位对齐)
    readphase[0] =(offset_addr & 0x1FE0)<<3;
    //第二个字节
    readphase[1] =(((offset_addr & 0x1F) << 3) | ESC_ETHERCAT_3BYTEADDR)<<8;//0-5λ��ַ��3�ֽڵ�ַ����
    //第三个字节
    readphase[2] = (offset_addr & 0xE000) | (ESC_ETHERCAT_READ <<10);//13-15λ��ַ�Ͷ���������
    //装载对应数据量的00字节
    for(i=0; i<numbytes; i++){
        readphase[i+3] = (uint16_t) ESC_ETHERCAT_CONTINUE<<8;
    }
    //最后一个字节以0xFF结尾
    readphase[numbytes+2] = (uint16_t)ESC_ETHERCAT_RDTERMINATE<<8;
#ifdef  USE_SPIB
    GpioDataRegs.GPCCLEAR.bit.GPIO66 = 1;//SPIB片选信号
#endif
#ifdef  USE_SPIA
    GpioDataRegs.GPBCLEAR.bit.GPIO61 = 1;//SPIA片选信号
#endif

            asm(" NOP");    //need 15ns delay
            asm(" NOP");
            asm(" NOP");
            asm(" NOP");
    //发送前三个地址
    for (i = 0; i < 3; i++)
    {
        SpixRegs->SPITXBUF = readphase[i];
    }
    //等待地址发送完成
    while (SpixRegs->SPIFFTX.bit.TXFFST > 0);
    //延时300ns
    for (i = 0; i < 4; i++)
    {
        asm(" NOP");
    }
   //发送读取字节数据
    for (i = 3; i < numbytes + 3; i++)
    {
        SpixRegs->SPITXBUF = readphase[i];
    }

       SPI_XmitInProgress=1;
    //等待接收到数据
        while(SpixRegs->SPIFFRX.bit.RXFFST < (numbytes+3))
        {
            asm(" NOP");    //need 12ns delay
            asm(" NOP");
            asm(" NOP");
        }
    //忽略前三个地址数据
        while(SpixRegs->SPIFFRX.bit.RXFFST > numbytes)
        {

            readval = SpixRegs->SPIRXBUF; //ignore

        }
    //读取数据
        for(i=0;(SpixRegs->SPIFFRX.bit.RXFFST > 0);i++)
        {
            readval = (SpixRegs->SPIRXBUF) & 0xFF;
            buf[i]= (readval & 0xFF);

            readval = (SpixRegs->SPIRXBUF) & 0xFF;
            buf[i] |= ((readval & 0xFF) << 8);
        }
#ifdef USE_SPIB
    GpioDataRegs.GPCSET.bit.GPIO66 = 1;//SPIB片选
#endif
#ifdef USE_SPIA
    GpioDataRegs.GPBSET.bit.GPIO61 = 1;//SPIA片选
#endif
    //SPIFIFO复位
    DELAY_US(2);
    SpixRegs->SPIFFTX.bit.TXFIFO=0;     // Reset Tx FIFO
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 0; //reset the FIFO pointer
    DELAY_US(2);
    SpixRegs->SPIFFTX.bit.TXFIFO=1;     // Reenable Tx FIFO
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 1; //reenable the FIFO operation

    SPI_XmitInProgress=0;

}
#define FIFO_LENGTH     12
/*****************************************************************************************
 * @fn          ESC_writeSPI
 * @brief       function writes up to 12 bytes of data
 *
 * @param
 *     offset_addr  - ESC address to which data has to written to
 *     numbytes     - number of bytes to be written to, limited to 12 at a time by the caller
 *     wrdata       - pointer to the buffer from where data has to be written to ESC
 *
 *
 * @return       - none
 ****************************************************************************************/
void ESC_writeSPI(uint16_t offset_addr,uint16_t *wrdata, uint16_t numbytes)
{
    uint16_t i, j,cmd, numwords = 0;
    uint16_t wptr = 0;
    uint16_t writephase[2];

    // Construct Address cmd bytes into 16-bit words for SPI xmission,
    //    SPI xmits MSBit 1st, so must swap bytes in this 16b word for transmission
    // Byte order of READ cmd sequence:
    // Byte 0: A[12:5]
    // Byte 1: A[4:0], 110b             (110b is 3-byte cmd extension)
    // Byte 2: A[15:13], CMD[2:0], 00b  (110b is 3-byte cmd extension)
    // Byte 3: Afirst byte of data

    //cmd = offset_addr & 0x1f
    cmd =(offset_addr & 0x1FE0)<<3; // offset_addr[12:5] is 1st address phase byte, shift to upper byte
    cmd |= (((offset_addr & 0x1F) << 3) | ESC_ETHERCAT_3BYTEADDR);
    writephase[0] = cmd;
    numwords++;
    cmd = 0x0000;
    cmd = (((offset_addr & 0xE000) | (ESC_ETHERCAT_WRITE <<10))) ;
    cmd |= (wrdata[wptr] & 0x00FF);
    writephase[1] = cmd;
    numwords++;

#ifdef  USE_SPIB
    GpioDataRegs.GPCCLEAR.bit.GPIO66 = 1;//SPIB片选信号
#endif
#ifdef  USE_SPIA
    GpioDataRegs.GPBCLEAR.bit.GPIO61 = 1;//SPIA片选信号
#endif

        asm(" NOP");    //need 15ns delay
        asm(" NOP");
        asm(" NOP");
        asm(" NOP");
        asm(" NOP");

    i = 0;

        SpixRegs->SPITXBUF = writephase[i] & (0xFF00);
        SpixRegs->SPITXBUF = ((writephase[i++] & (0xFF)) << 8);
        SpixRegs->SPITXBUF = writephase[i] & (0xFF00);
        SpixRegs->SPITXBUF = ((writephase[i] & (0xFF)) << 8);

    wptr=0;

    for(j = 1; j < (numbytes-1) ; j+=2)
    {
        SpixRegs->SPITXBUF = ((wrdata[wptr]) & 0xFF00);
        SpixRegs->SPITXBUF= (((wrdata[++wptr]) & 0x00FF) << 8);
        numwords++;
    }
    if(j == (numbytes-1))
    {
        SpixRegs->SPITXBUF = ((wrdata[wptr]) & 0xFF00);
        numwords++;
    }

    SPI_XmitInProgress=1;

    while(SpixRegs->SPIFFTX.bit.TXFFST != 0)
    {
        DELAY_US(2);
    };

#ifdef USE_SPIB
    GpioDataRegs.GPCSET.bit.GPIO66 = 1;//SPIB片选
#endif
#ifdef USE_SPIA
    GpioDataRegs.GPBSET.bit.GPIO61 = 1;//SPIA片选
#endif

    DELAY_US(2);
    SpixRegs->SPIFFTX.bit.TXFIFO=0;     // Reset Tx FIFO
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 0; //reset the FIFO pointer
    DELAY_US(2);
    SpixRegs->SPIFFTX.bit.TXFIFO=1;     // Reset Tx FIFO
    SpixRegs->SPIFFRX.bit.RXFIFORESET = 1; //reenable the FIFO operation

    SPI_XmitInProgress=0;


}
/***********************************************************************************/
uint16_t ESC_readWordNonISR(uint16_t offset_addr)
{
    uint16_t data;
    DINT;
    ESC_readSPI(offset_addr, 2, &data);
    EINT;
    return  data;
}
/***********************************************************************************/
uint16_t ESC_readWordISR(uint16_t offset_addr)
{
    ESC_readSPI(offset_addr, 2, 0);
    return  (SPI_RxData[0]);

}
/***********************************************************************************/

uint32_t ESC_readDWordNonISR(uint16_t offset_addr)
{
    uint32_t dword;
    DINT;
    ESC_readSPI(offset_addr, 4, (uint16_t *)&dword);
    EINT;
    return dword;
}
/***********************************************************************************/
uint32_t ESC_readDWordISR(uint16_t offset_addr)
{
    uint32_t dword;

    ESC_readSPI(offset_addr, 4, (uint16_t *)&dword);

    return dword;
}
/***********************************************************************************/
void ESC_readBlockISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{
    uint16_t i = 0, current_bytes = 0, last_byte = 0;
    if(numbytes & 0x1)
    {
        current_bytes = (numbytes - 0x1); // even align
    }
    else
    {
        current_bytes = numbytes;
    }
    while(current_bytes > 0) // input is actually in bytes
    {
        if( current_bytes >= FIFO_LENGTH)
        {
            ESC_readSPI(offset_addr, FIFO_LENGTH, (uint16_t *) &pData[i]);
            current_bytes -= FIFO_LENGTH;
            i+= FIFO_LENGTH/2; // data is in 16 bits
            offset_addr += FIFO_LENGTH;
        }
        else
        {
            ESC_readSPI(offset_addr, current_bytes, (uint16_t *) &pData[i]);
            offset_addr += current_bytes;
            i+= current_bytes/2;
            current_bytes = 0;
        }
    }

    if(numbytes & 0x1)
    {

        last_byte =  ESC_readWordISR(offset_addr);
        pData[i] = pData[i] & 0xFF00;
        pData[i] |= last_byte;

