isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
    }

}
/***********************************************************************************/
void ESC_readBlockNonISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{

    DINT;
    ESC_readBlockISR(pData, offset_addr,numbytes);
    EINT;

}

/***********************************************************************************/
void ESC_writeWordNonISR(uint16_t wrdata, uint16_t offset_addr)
{
    DINT;
    ESC_writeSPI(offset_addr, &wrdata, 0x02);
    EINT;
}
/***********************************************************************************/
void ESC_writeWordISR(uint16_t wrdata, uint16_t offset_addr)
{
    ESC_writeSPI(offset_addr, &wrdata, 0x02);
}
/***********************************************************************************/
void ESC_writeDWordNonISR(uint32_t wrdata, uint16_t offset_addr)
{
    DINT;
    ESC_writeSPI(offset_addr, (uint16_t *)&wrdata, 0x04);
    EINT;
}
/***********************************************************************************/
void ESC_writeDWordISR(uint32_t wrdata, uint16_t offset_addr)
{
    ESC_writeSPI(offset_addr, (uint16_t *)&wrdata, 0x04);
}
/***********************************************************************************/

void ESC_writeBlockISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{
    uint16_t i = 0, current_bytes = 0;

    if(numbytes & 0x1)
    {
        current_bytes = (numbytes - 0x1); // even align
    }
    else
    {
        current_bytes = (numbytes);
    }
    while(current_bytes > 0) // input is actually in bytes
    {
        if( current_bytes >= FIFO_LENGTH)
        {
            ESC_writeSPI(offset_addr, (uint16_t *) &pData[i], FIFO_LENGTH);
            current_bytes -= FIFO_LENGTH;
            i+= FIFO_LENGTH/2; // data is in 16 bits
            offset_addr += FIFO_LENGTH;
        }
        else
        {
            ESC_writeSPI(offset_addr, (uint16_t *) &pData[i], current_bytes);
            offset_addr += current_bytes;
            i+= current_bytes/2;
            current_bytes = 0;
        }
    }

    if(numbytes & 0x1)
    {
        //now send the last byte with extra alignment bytes
        // note that we read the adjacent byte and write it back
        ESC_readSPI(offset_addr, 2, &i);
        i &= 0xFF00;
        i |= (pData[((numbytes-1) >> 1)]) & 0xFF;   //pData is 16bit pointer
        ESC_writeSPI(offset_addr, &i, 2);
    }
}
/***********************************************************************************/
void ESC_writeBlockNonISR(uint16_t* pData, uint16_t offset_addr,uint16_t numbytes)
{

    DINT;
    ESC_writeBlockISR(pData, offset_addr,numbytes);
    EINT;
}


//-----------------------------------------------------------------------------------
// Function to initialize SPI port
//-----------------------------------------------------------------------------------
void ESC_initSPIFIFO(void)
{
    uint16_t m;
    EALLOW;

    // FIFO configuration
    SpixRegs->SPIFFCT.all=0x0;              // place SPI in reset
    for(m=0;m<3;m++);
    SpixRegs->SPIFFRX.all=0x2040;           // RX FIFO enabled, clear FIFO int
    SpixRegs->SPIFFRX.bit.RXFFIL = 16;      // Set RX FIFO level
    SpixRegs->SPIFFTX.all=0xE040;           // FIFOs enabled, TX FIFO released,

    // SPI configuration
    SpixRegs->SPIFFTX.bit.TXFFIL = 16;  // Set TX FIFO level
    SpixRegs->SPICCR.bit.HS_MODE = 0x1; // Set high mode
    SpixRegs->SPICCR.bit.SPICHAR = 0x7;//0xF; // Character Length  = 8
    SpixRegs->SPICCR.bit.CLKPOLARITY = 1; // Rising edge
    SpixRegs->SPICTL.bit.SPIINTENA = 1;     // Enabled
    SpixRegs->SPICTL.bit.TALK = 1;          //
    SpixRegs->SPICTL.bit.MASTER_SLAVE = 1;  // Master mode
    SpixRegs->SPICTL.bit.CLK_PHASE = 0;     // Add 1/2-cycle delay of Clk wrt SPISTEA
    SpixRegs->SPICTL.bit.OVERRUNINTENA = 1; // Overrun Interrupt enabled
    SpixRegs->SPISTS.all=0x0000;        // Clear Status bits (TxBufFull,INT, Overrun)

    // SpixRegs->SPIBRR.all = 0x63;            // LSPCLK/100

    ClkCfgRegs.LOSPCP.all = 0x1; // 0 = sysclk/1 = 200M;  1 = sysclk/2 = 100M
    SpixRegs->SPIBRR.all=0x04;     // Baud Rate = LSPCLK / (SPIBRR+1) [LSPCLK=SysClk/4] = 20MHz

    SpixRegs->SPIFFCT.all=0x00;
    SpixRegs->SPIPRI.all=0x0020;            // Stop after transaction complete on EmuStop

    SpixRegs->SPIFFTX.bit.TXFFIENA = 0; // Disable TXFF INT
    SpixRegs->SPIFFRX.bit.RXFFIENA = 0; // disable RXFF INT


    SpixRegs->SPICCR.bit.SPISWRESET=1;  // Enable SPI

   EDIS;
}

//-----------------------------------------------------------------------------------
// Function to initialize GPIOs for SPIB port
//   GPIO64, GPIO65, GPIO66, GPIO63 
// brief: GPIO66设置为普通引脚
//-----------------------------------------------------------------------------------
void ESC_initSPIBGpio(void)
{
    EALLOW;
        // Enable pull-ups on SPISIMO/SPISOMI/SPICLK/SPISTE pins
        GpioCtrlRegs.GPCPUD.all &= 0xFFFFFFF8;
        GpioCtrlRegs.GPBPUD.all &= 0xFFFFFFFE;

        // Enable SPISIMO/SPISOMI/SPICLK pins
        GpioCtrlRegs.GPCGMUX1.bit.GPIO64 = 0x3;
        GpioCtrlRegs.GPCMUX1.bit.GPIO64 = 0x3;
        GpioCtrlRegs.GPCGMUX1.bit.GPIO65 = 0x3;
        GpioCtrlRegs.GPCMUX1.bit.GPIO65 = 0x3;
     //   GpioCtrlRegs.GPCGMUX1.bit.GPIO66 = 0x3;
     //   GpioCtrlRegs.GPCMUX1.bit.GPIO66 = 0x3;
        GpioCtrlRegs.GPBGMUX2.bit.GPIO63 = 0x3;
        GpioCtrlRegs.GPBMUX2.bit.GPIO63 = 0x3;

        // Enable SPISIMO/SPISOMI/SPICLK pins as async
        GpioCtrlRegs.GPCQSEL1.all |= 0xF;
        GpioCtrlRegs.GPBQSEL2.bit.GPIO63 = 0x3;

    EDIS;

       //GPIO66 set output
       GPIO_SetupPinOptions(66,GPIO_OUTPUT, GPIO_PULLUP);
       GPIO_SetupPinMux(66, GPIO_MUX_CPU1, 0);
}
//-----------------------------------------------------------------------------------
// Function to initialize GPIOs for SPIC port
//   GPIO122, GPIO123, GPIO124, GPIO125 
//   Function used in TMDSECATCNCD379D kit
//-----------------------------------------------------------------------------------
void ESC_initSPICGpio(void)
{
    EALLOW;
        // new control card with HD connector
        // Enable pull-ups on SPISIMO/SPISOMI/SPICLK/SPISTE pins
        //GPIO122,123,124,125
        GpioCtrlRegs.GPDPUD.all &= 0xC3FFFFFF;

