isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
}


//-----------------------------------------------------------------------------------
// 用于配置SYNC0信号的功能
//-----------------------------------------------------------------------------------
void ESC_configureSync0GPIO(void)
{
    //设置SYNC0引脚为输出引脚
    GPIO_SetupPinOptions(ESC_SYNC0_GPIO, GPIO_INPUT, GPIO_PULLUP| GPIO_ASYNC);
    GPIO_SetupPinMux(ESC_SYNC0_GPIO, GPIO_MUX_CPU1, 0);
    //设置引脚触发外部中断
    EALLOW;
    InputXbarRegs.INPUT14SELECT = ESC_SYNC0_GPIO; //input14 is tied to XINT5
    PieVectTable.XINT5_INT = &ESC_applicationSync0ISR;

    XintRegs.XINT5CR.bit.POLARITY = 1;      //下降沿中断
    XintRegs.XINT5CR.bit.ENABLE = 1;

    PieCtrlRegs.PIEIER12.bit.INTx3 = 1;     // 使能 Group 1, INT5 (XINT2)

    IER |= 0x0800;

    EDIS;

   //ESC_enableSync0DebugOnCCARD();
}


//-----------------------------------------------------------------------------------
// Function to enable debug of SYNC0 signal on ControlCard configurations
//-----------------------------------------------------------------------------------
void ESC_enableSync1DebugOnCCARD(void)
{
    //for debug of SYNC1 line.- the below code connects GPIO3 to the SYNC1
    //internally because on the HW board we cannot put a scope on SYNC1 on HighRose connector

    //Connect SYNC1 is INPUT1 for
    EALLOW;
    InputXbarRegs.INPUT2SELECT = ESC_SYNC1_GPIO; //input2 is tied to SYNC1

    OutputXbarRegs.OUTPUT2MUX0TO15CFG.bit.MUX3 = 0x1; //INPUTXBAR2 to OUTPUTXBAR2
    OutputXbarRegs.OUTPUT2MUXENABLE.bit.MUX3 = 0x1;

    GpioCtrlRegs.GPAGMUX1.bit.GPIO3 = 0x01; //GPIO3 to OUTPUTXBAR2
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 0x01;
    EDIS;
}

//-----------------------------------------------------------------------------------
// Function to configure SYNC1 signal on ControlCard configurations
//-----------------------------------------------------------------------------------
void ESC_configureSync1GPIO(void)
{

    GPIO_SetupPinOptions(ESC_SYNC1_GPIO, GPIO_INPUT, GPIO_PULLUP| GPIO_ASYNC);
    GPIO_SetupPinMux(ESC_SYNC1_GPIO, GPIO_MUX_CPU1, 0);

    EALLOW;
    InputXbarRegs.INPUT13SELECT = ESC_SYNC1_GPIO; //input13 is tied to XINT4
    PieVectTable.XINT4_INT   = &ESC_applicationSync1ISR;

    XintRegs.XINT4CR.bit.POLARITY = 1;      // Falling edge interrupt
    XintRegs.XINT4CR.bit.ENABLE = 1;

    PieCtrlRegs.PIEIER12.bit.INTx2 = 1;     // Enable Group 12, INT2 (XINT4)
    IER |= 0x0800;
    EDIS;   // This is needed to disable write to EALLOW protected registers

   //ESC_enableSync1DebugOnCCARD();
}
/***********************************************************************************/
void ESC_resetET1100(void)
{

    GPIO_SetupPinMux(ESC_RESET_ET1100_GPIO, GPIO_MUX_CPU1, 0);
    GPIO_SetupPinOptions(ESC_RESET_ET1100_GPIO,GPIO_OUTPUT,GPIO_PULLUP);
    GPIO_WritePin(ESC_RESET_ET1100_GPIO, 0);    //hold reset low
    DELAY_US(500*1000);

    GPIO_WritePin(ESC_RESET_ET1100_GPIO, 1);    //release reset
    DELAY_US(500*1000);
}
/***********************************************************************************/
uint16_t  ESC_ET1100EEPROMLoadedCheck(void)
{
    uint16_t ii = 0;
    GPIO_SetupPinMux(ESC_EEPROM_LOADED_GPIO, GPIO_MUX_CPU1, 0);
    while(!GPIO_ReadPin(ESC_EEPROM_LOADED_GPIO))
    {
      DELAY_US(500*1000);
      ii++;
      if(ii > 10)
          break;
    }
    if(ii > 10)
        return 0;
    else
        return 1;

}

/***********************************************************************************/
void ESC_passFailSignalSetup(void)
{
    // Note:- This function is not called when EMIF1 is used because there
    // is conflict with GPIO31 and GPIO34 with EMIF1 signals and LEDs
    // so with LAUNCHXL2.0 , user will only know if there is an error
    // Both LEDs (GPIO31 and GPIO34 HIGH or LOW always means no error on
    // Launchpad XL 2.0)

    GPIO_SetupPinMux(34, GPIO_MUX_CPU1, 0);
    GPIO_SetupPinMux(31, GPIO_MUX_CPU1, 0);

    GPIO_SetupPinOptions(34, 1, GPIO_OPENDRAIN | GPIO_PULLUP);
    GPIO_SetupPinOptions(31, 1, GPIO_OPENDRAIN | GPIO_PULLUP);

    //GPIO34 and GPIO31 at HIGH - means NO ERROR
    //keep GPIO31 and GPIO34 LOW for PASS - by default
    GpioDataRegs.GPADAT.bit.GPIO31 = 1;
    GpioDataRegs.GPBDAT.bit.GPIO34 = 1;

}
/***********************************************************************************/
void ESC_signalFail(void)
{
    //Toggle GPIO34 and GPIO31 for fail
    GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    GpioDataRegs.GPATOGGLE.bit.GPIO31 = 1;
    DELAY_US(10 * 1000);
}
/***********************************************************************************/
void ESC_signalPass(void)
{
    //keep GPIO31 and GPIO34 LOW for PASS
    GpioDataRegs.GPADAT.bit.GPIO31 = 1;
    GpioDataRegs.GPBDAT.bit.GPIO34 = 1;

    DELAY_US(500 * 1000);
}
/***********************************************************************************/
void ESC_initHW(void)
{

    //pEsc = MAKE_PTR_TO_ESC;

#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
    pEsc = (uint16_t *)0x100000;  //EMIF1
#else
    pEsc = (uint16_t *)0x2000;    //EMIF2
#endif


#ifdef FLASH
    // Copy time critical code and Flash setup code to RAM
    // The  RamfuncsLoadStart, RamfuncsLoadEnd, and RamfuncsRunStart
    // symbols are created by the linker. Refer to the linker files.
    memcpy(&RamfuncsRunStart, &RamfuncsLoadStart, (uint32_t)&RamfuncsLoadSize);
#endif


    InitSysCtrl();

    // Only used if running from FLASH
    // Note that the variable FLASH is defined by the compiler

#ifdef FLASH
    // Call Flash Initialization to setup flash waitstates
    // This function must reside in RAM
    InitFlash();    // Call the flash wrapper init function
#endif //(FLASH)


    DINT;
    //  Initialize the PIE control registers to their default state.
    //  The default state is all PIE interrupts disabled and flags
    //  are cleared.
    //  This function is found in the F2837xD_PieCtrl.c file.
    InitPieCtrl();

    // Disable CPU interrupts and clear all CPU interrupt flags:
    EALLOW;
    IER = 0x0000;
    IFR = 0x0000;
    EDIS;

