isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // GService Routines (ISR).
    // This will populate the entire table, even if the interrupt
    // is not used in this example.  This is useful for debug purposes.
    // The shell ISR routines are found in F2837xD_DefaultIsr.c.
    // This function is found in F2837xD_PieVect.c.
    InitPieVectTable();

    //配置为以全速率运行EMIF1（EMIF1CLK = CPU1SYSCLK / 2）
    EALLOW;
    ClkCfgRegs.PERCLKDIVSEL.bit.EMIF1CLKDIV = 0x1;
    ClkCfgRegs.PERCLKDIVSEL.bit.EMIF2CLKDIV = 0x1;
    EDIS;

    EALLOW;
    InitGpio(); // Default setup for all pins
    InitCpuTimers();

//------------------------------------------------------------------------------
#ifdef INTERFACE_SPI

  SPI_XmitInProgress=0;//标志SPI未在运行

#ifdef USE_SPIA
  SpixRegs = &SpiaRegs;
   ESC_initSPIAGpio();
#elif USE_SPIC
  SpixRegs = &SpicRegs;
  ESC_initSPICGpio();
#else
  SpixRegs = &SpibRegs;
  ESC_initSPIBGpio();
#endif
  ESC_initSPIFIFO();

  EALLOW;
  PieVectTable.XINT1_INT = &ESC_applicationLayerISR;
  EDIS;

  // 从ET1200配置外部中断
  EALLOW;
  InputXbarRegs.INPUT4SELECT = ESC_SPI_INT_GPIO ;
  GPIO_SetupPinOptions(ESC_SPI_INT_GPIO, GPIO_INPUT, GPIO_PULLUP | GPIO_ASYNC);
  EDIS;

  EALLOW;
  XintRegs.XINT1CR.bit.POLARITY = 0x0;      // 外部中断1设置为下降沿中断
  XintRegs.XINT1CR.bit.ENABLE = 1;          //使能外部中断1

  // 启用此示例所需的中断
  PieCtrlRegs.PIECTRL.bit.ENPIE = 1;        // 启用PIE块
  PieCtrlRegs.PIEIER1.bit.INTx4 = 1;        // 使能 Group 1, INT4 (XINT1)

  IER=0x01;                            // 使能 CPU INT1
  EINT;                                // 使能全局中断

  ESC_passFailSignalSetup();          //初始化检查指示灯
#else
    // 使用EMIF数据接口(16b, async)

  // Configure External Interrupt from ET1100
  EALLOW;
  //keep LOSPCP same as SPI MODE of PDI
  ClkCfgRegs.LOSPCP.all = 0x1; // 0 = sysclk/1 = 200M; 1 = sysclk/2 = 100M

  PieVectTable.XINT1_INT = &ESC_applicationLayerISR;

  InputXbarRegs.INPUT4SELECT = ESC_EMIF_INT_GPIO ;
  GPIO_SetupPinOptions(ESC_EMIF_INT_GPIO, GPIO_INPUT, GPIO_PULLUP | GPIO_ASYNC);

#ifdef DEBUG //enabled for TIMING of ISR
  EALLOW;
  //for debug - the same below code is used for SYNC0/SYNC1 monitoring
  //user has to either change the GPIO used or comment out the monitoring of SYNC0 or
  //SYNC1 before enabling below code

//  //for debug of Interrupt line.- the below code connects GPIO2 to the GPIO78
    //internally because on the HW board we cannot put a scope on GPIO78 on CCARD,

//  OutputXbarRegs.OUTPUT1MUX0TO15CFG.bit.MUX7 = 0x1; //INPUTXBAR4 to OUTPUTXBAR1
//  OutputXbarRegs.OUTPUT1MUXENABLE.bit.MUX7 = 0x1;
//
//  GpioCtrlRegs.GPAGMUX1.bit.GPIO2 = 0x01;
//  GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 0x01;
#endif

  XintRegs.XINT1CR.bit.POLARITY = 0;      // Falling edge interrupt
  XintRegs.XINT1CR.bit.ENABLE = 1;
  EDIS;

  PieCtrlRegs.PIECTRL.bit.ENPIE = 1;    // Enable the PIE block
  PieCtrlRegs.PIEIER1.bit.INTx4 =1;     // Enable Group 1, INT4 (XINT1)

  IER=0x01;                             // Enable CPU INT1
  EINT;                                 // Enable Global Interrupts

  // Grab EMIF1 For CPU1
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
  Emif1ConfigRegs.EMIF1MSEL.all = (uint32_t) 0x93A5CE71;

  // Disable Access Protection (CPU_FETCH/CPU_WR/DMA_WR)
  Emif1ConfigRegs.EMIF1ACCPROT0.all = 0x0;

  // Commit the configuration related to protection. Till this bit remains set
  // content of EMIF1ACCPROT0 register can't be changed.
  Emif1ConfigRegs.EMIF1COMMIT.all = 0x1;

  // Lock the configuration so that EMIF1COMMIT register can't be changed any more.
  Emif1ConfigRegs.EMIF1LOCK.all = 0x1;

  //Configure GPIO pins for EMIF1
  //setup_emif1_pinmux_async_16bit(0);
  setup_emif1_pinmux_async_16bit_option2(0);

  //Configure the access timing for CS2 space
  Emif1Regs.ASYNC_CS2_CR.all =  (EMIF_ASYNC_ASIZE_16    |
                                 EMIF_ASYNC_TA_1        |   // Wr to Rd turnaround
                                 EMIF_ASYNC_RHOLD_2     |   //
                                 EMIF_ASYNC_RSTROBE_56  |   //
                                 EMIF_ASYNC_RSETUP_4    |   //
                                 EMIF_ASYNC_WHOLD_2     |   //
                                 EMIF_ASYNC_WSTROBE_28  |   //
                                 EMIF_ASYNC_WSETUP_4    |
                                 EMIF_ASYNC_EW_ENABLE   |   // EMIF_ASYNC_EW_DISABLE
                                 EMIF_ASYNC_SS_DISABLE      // Strobe Select Mode Disable.
                                );
  Emif1Regs.ASYNC_WCCR.bit.WP0 = 1;             // Active-high Wait Polarity for EM1WAIT.
  Emif1Regs.ASYNC_WCCR.bit.MAX_EXT_WAIT = 0x1;
#else

  // Disable Access Protection (CPU_FETCH/CPU_WR/DMA_WR)
  Emif2ConfigRegs.EMIF2ACCPROT0.all = 0x0;

  // Commit the configuration related to protection. Till this bit remains set
  // content of EMIF1ACCPROT0 register can't be changed.
  Emif2ConfigRegs.EMIF2COMMIT.all = 0x1;

  // Lock the configuration so that EMIF1COMMIT register can't be changed any more.
  Emif2ConfigRegs.EMIF2LOCK.all = 0x1;

  //Configure GPIO pins for EMIF1
  setup_emif2_pinmux_async_16bit(0);

  //Configure the access timing for CS2 space
  Emif2Regs.ASYNC_CS2_CR.all =  (EMIF_ASYNC_ASIZE_16    |
                                 EMIF_ASYNC_TA_1        |   // Wr to Rd turnaround
                                 EMIF_ASYNC_RHOLD_2     |   //
                                 EMIF_ASYNC_RSTROBE_56  |   //
                                 EMIF_ASYNC_RSETUP_4    |   //
                                 EMIF_ASYNC_WHOLD_2     |   //
                                 EMIF_ASYNC_WSTROBE_28  |   //
                                 EMIF_ASYNC_WSETUP_4    |
                                 EMIF_ASYNC_EW_ENABLE   |   // EMIF_ASYNC_EW_DISABLE
                                 EMIF_ASYNC_SS_DISABLE      // Strobe Select Mode Disable.
                                );
  Emif2Regs.ASYNC_WCCR.bit.WP0 = 1;             // Active-high Wait Polarity for EM1WAIT.
  Emif2Regs.ASYNC_WCCR.bit.MAX_EXT_WAIT = 0x1;

  ESC_passFailSignalSetup();
#endif // USE_EMIF1
#endif //INTERFACE_SPI


  EALLOW;

  CpuTimer0Regs.TCR.bit.TSS = 0;    //开启定时器0

    //配置SYNC0 SYNC1引脚
    ESC_configureSync0GPIO();
    ESC_configureSync1GPIO();
  //  ESC_configureLatch0GPIO()
  //  ESC_configureLatch1GPIO();

