isliulin/EtherCAT_ET1200_TMS320F28379D/hal/etherCAT_slave_c28x_hal.c
 //复位ET1200
  ESC_resetET1100();
 //检查ET1200 EEPROM是否装载
  if(!ESC_ET1100EEPROMLoadedCheck())
  {
      //EEPROM 加载失败
      //信号错误
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
      ESC_passFailSignalSetup();
      //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
      //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
        while(1)
        {
            //失败
            ESC_signalFail();
            DELAY_US(500 * 1000);
        }
  }

}
/***********************************************************************************/
#ifdef PDI_HAL_TEST     //enable this to test the PDI HAL API
#define TEST_DATA_LENGTH    10
uint32_t wr_test_data[TEST_DATA_LENGTH];
uint32_t rd_test_data[TEST_DATA_LENGTH];
/***********************************************************************************/
void ESC_debugInitESCRegLogs(void)
{
    uint16_t i = 0;

    for(i=0; i < ESC_DEBUG_REGS_LENGTH ; i++)
    {
        escRegs[i].address = escRegs[i].data = 0xFFFF;
    }
}
/***********************************************************************************/
void ESC_debugAddESCRegsAddress(uint16_t address)
{
    uint16_t i = 0;
    for(i=0; i < ESC_DEBUG_REGS_LENGTH ; i++)
    {
        if( escRegs[i].address == 0xFFFF)
        {
            //memcpy(&escRegs[i].name[0], name, namelen);
            escRegs[i].address = address;
            return;
        }
    }
}
/***********************************************************************************/
void ESC_debugUpdateESCRegLogs(void)
{
    uint16_t i = 0;
    while(escRegs[i].address != 0xFFFF)
    {
        escRegs[i].data = ESC_readWordNonISR(escRegs[i].address);
        i++;
    }
}
/***********************************************************************************/
void clear_test_data(void)
{
    uint16_t ii=0;
    for(ii =0; ii < TEST_DATA_LENGTH; ii++)
    {
        wr_test_data[ii] = rd_test_data[ii] = 0UL;
    }
}
/***********************************************************************************/
void init_wr_test_data(void)
{
    uint16_t ii=0;
    for(ii =0; ii < TEST_DATA_LENGTH; ii++)
    {
        wr_test_data[ii] = 0xBABAABBAUL;
    }
}
/***********************************************************************************/
//local test function pass fail defines
#define BLOCKTEST_PASS  1
#define BLOCKTEST_FAIL  0
uint16_t block_test_data(uint16_t numbytes)
{
    uint16_t ii = 0, jj = 0;
    uint16_t *wrdata = (uint16_t *)(&wr_test_data[0]);
    uint16_t *rddata = (uint16_t *)(&rd_test_data[0]);
    if(numbytes & 0x1) //odd
    {
        ii = (numbytes -1)/2;
    }
    else
    {
        ii = (numbytes)/2;
    }
    while(ii)
    {
        if((*wrdata++) != (*rddata++))
            goto fail_block_rw;
        jj++;
        ii--;
    }
    if(numbytes & 0x1) //odd
    {
        //for last byte
        if(((*wrdata) & 0x00FF) != ((*rddata) & 0x00FF))
        {
            goto fail_block_rw;
        }
        else
        {
            return BLOCKTEST_PASS;
        }
    }
    else
    {
        return BLOCKTEST_PASS;
    }

fail_block_rw:
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
      ESC_passFailSignalSetup();
      //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
      //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
    while(1)
    {
        //fail
        ESC_signalFail();
    }
}
/***********************************************************************************/
void ESC_setupPDITestInterface(void)
{
    uint32_t test_address = 0x0000UL;
    uint32_t dtest_data = 0xFFFFFFFFUL;
    uint16_t pdi_control = 0x0;
    uint16_t ii = 0;

     ESC_debugInitESCRegLogs();
     ESC_debugAddESCRegsAddress(0x0);     /* "type" */
     ESC_debugAddESCRegsAddress(0x2);     /* "build" */
     ESC_debugAddESCRegsAddress(0x4);     /* "fmmu" */
     ESC_debugAddESCRegsAddress(0x8);     /* "rams" */
     ESC_debugAddESCRegsAddress(0x100);   /* "dlc1" */
     ESC_debugAddESCRegsAddress(0x102);   /* "dlc2" */
     ESC_debugAddESCRegsAddress(0x110);   /* "dls"  */
     ESC_debugAddESCRegsAddress(0x310);   /* "llc1" */
     ESC_debugAddESCRegsAddress(0x312);   /* "llc2" */
     ESC_debugAddESCRegsAddress(0xE00);   /* "porv" */
     ESC_debugAddESCRegsAddress(0x510);   /* "miis" */
     ESC_debugAddESCRegsAddress(0x512);   /* "phya" */
     ESC_debugAddESCRegsAddress(0x514);   /* "phyd" */
     ESC_debugAddESCRegsAddress(0x516);   /* "miia" */
     ESC_debugAddESCRegsAddress(0x518);   /* "port0" */
     ESC_debugAddESCRegsAddress(0x51A);   /* "port1" */
     ESC_debugAddESCRegsAddress(0x1000);  /* "RAM address"*/

     init_wr_test_data();

     //Now wait till EEPROM is loaded
    do
    {
        pdi_control = ESC_readWordNonISR(0x0140); /*ESC_PDI_CONTROL_OFFSET*/
        if( ii++ == 0x100)
            break;
#ifdef INTERFACE_SPI
    } while  (((pdi_control & 0xFF) != 0x05));  //SPI PDI
#else
    } while  (((pdi_control & 0xFF) != 0x08));  //EMIF PDI
#endif

    if( ii >= 0x100)
    {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
      ESC_passFailSignalSetup();
      //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
      //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
        while(1)
        {
            //fail
            ESC_signalFail();
            DELAY_US(500 * 1000);
        }
    }

    // NOW EEPROM is loaded and PDI is either EMIF (16 bit) or SPI.
    // ET1100 RAM read/write tests; On ET1100 RAM being at 0x1000 and can go up to 0xFFFF

#ifdef INTERFACE_SPI
     // with SPI we can address 0x1000 to 0xFFFF address range of ET1100
     for(test_address = ESC_PDI_RAM_START_ADDRESS_OFFSET; test_address <= ESC_PDI_RAM_END_ADDRESS_OFFSET; test_address+=4)

#else
     // the EMIF2 address range is between 0x2000 to 0x2FFF words.
     // This means we can address 0x1000 - 0x2000 of the RAM address range of ET1100
     // which is equivalent to 0x2800 to 0x2FFF of the C28x EMIF2 address space.
     //please refer to ET1100 datasheet for more details
    for(test_address = ESC_PDI_RAM_START_ADDRESS_OFFSET; test_address <= ESC_PDI_RAM_END_ADDRESS_OFFSET; test_address+=4)
#endif
    {

        ///////////////////////////////////////////////////
        //////READ DWORD and WRITE DWORD NON ISR API Test
        ///////////////////////////////////////////////////
        dtest_data = ESC_readDWordNonISR(test_address);
        ESC_writeDWordNonISR(0xBAADF00D, test_address);
        dtest_data = ESC_readDWordNonISR(test_address);
        if(dtest_data != (uint32_t)0xBAADF00D)
         {
#ifdef USE_EMIF1    //LAUNCHXL Rev2.0 J9 connector option for accessing ET1100
            ESC_passFailSignalSetup();
            //GPIO31 and 34 are EMIF1 signals so re-use them as GPIO
            //claim it back from EMIF since there is a problem    ESC_passFailSignalSetup();
#endif
            while(1)
            {
                //fail
                ESC_signalFail();
            }

